Конфигурация отчетов/InformationRegisters/СеансыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СеансыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Атрибут</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АтрибутыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/РодительЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РодительЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/КласификацияЗаписей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КласификацияЗаписей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаписей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/АтрибутыОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АтрибутыОборудования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиента</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
						<v8:Type>cfg:CatalogRef.Локации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиента</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОборудования</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияОборудования</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидИнформацииОборудования</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
						<v8:Type>cfg:CatalogRef.Локации</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/CommonModules/НовыеЗаписиВ_Регистры/Ext/Module.bsl
Процедура ЗаписьСеанса() Экспорт 

	Сеанс = РегистрыСведений.СеансыПользователей.СоздатьНаборЗаписей();
	Сеанс.Записывать = Истина;
	НовыйСеанс = Сеанс.Добавить();
	
	НовыйСеанс.Пользователь = Константы.ПользовательПоУмолчанию.Получить();
	НовыйСеанс.Сеанс = НомерСоединенияИнформационнойБазы();

	//НовыйСеанс.Сеанс = НомерСоединенияИнформационнойБазы();
	Сеанс.Записать();

КонецПроцедуры

Процедура ЗаписьАтрибута_В_Регистр(Задача, Атрибут, Значение, Автор) Экспорт 

	Запись = РегистрыСведений.АтрибутыЗадачи.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Задача = Задача;
    Запись.Атрибут = Атрибут;
    Запись.Значение = Значение;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Атрибут успешно обновлен " + Строка(Атрибут)); 
    Исключение
        Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура ЗаписьРодителя_В_Регистр(Задача, Родитель, Автор) Экспорт 

	Запись = РегистрыСведений.РодительЗадачи.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Задача = Задача;
    Запись.Родитель = Родитель;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Родитель задачи успешно обновлен!");
    Исключение
        Сообщить("Ошибка при записи в родителя Задачи: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура ЗаписьВидаЗадачи_В_Регистр(Задача, Значение, Автор) Экспорт 

	Запись = РегистрыСведений.КласификацияЗаписей.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
	Запись.Задача = Задача;
	Запись.Значение = Значение;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Вид задачи успешно обновлен ");

    Исключение
        Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры

Процедура ЗаписьАтрибутаОборудования_В_Регистр(Оборудование, ХарактеристикаДанных, Значение, Автор) Экспорт 

	Запись = РегистрыСведений.АтрибутыОборудования.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Оборудование = Оборудование;
    Запись.ХарактеристикаДанных = ХарактеристикаДанных;
    Запись.Значение = Значение;
    Запись.Автор = Автор;

    Попытка
        Запись.Записать(Истина);
		Сообщить("Атрибут оборудования успешно обновлен " + Строка(ХарактеристикаДанных)); 
    Исключение
        Сообщить("Ошибка при записи в регистр сведений: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры
